EDT/ZUP/zup_edt/src/InformationRegisters/ПубликацияВакансий/ПубликацияВакансий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПубликацияВакансий</name>
  <resources>
    <name>АдресПубликации</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВакансии</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСнятияСПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоПубликации</name>
    <type>
      <types>CatalogRef.ИсточникиИнформацииОКандидатах</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/InformationRegisters/ПубликацияВакансий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьАдресПубликацииЗаписи(ЗаписьОПубликации) Экспорт
	
	ИдентификаторВакансии = ЗаписьОПубликации.ИдентификаторВакансии;
	
	Если ЗаписьОПубликации.МестоПубликации = ИнтеграцияРекрутинговыхСайтовКлиентСервер.HeadHunter() Тогда
		ЗаписьОПубликации.АдресПубликации = ИнтеграцияРекрутинговыхСайтов.АдресВакансииHeadHunter(ИдентификаторВакансии);
	ИначеЕсли ЗаписьОПубликации.МестоПубликации = ИнтеграцияРекрутинговыхСайтовКлиентСервер.SuperJob() Тогда
		ЗаписьОПубликации.АдресПубликации = ИнтеграцияРекрутинговыхСайтов.АдресВакансииSuperJob(ИдентификаторВакансии);
	ИначеЕсли ЗаписьОПубликации.МестоПубликации = ИнтеграцияРекрутинговыхСайтовКлиентСервер.Rabota() Тогда
		ЗаписьОПубликации.АдресПубликации = ИнтеграцияРекрутинговыхСайтов.АдресВакансииRabota(ИдентификаторВакансии)
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
